In [22]:
import pandas as pd
import polars as pl
from matplotlib import pyplot as plt
import seaborn as sns
import sys
import numpy as np

np.set_printoptions(threshold=sys.maxsize)
np.set_printoptions(suppress=True)
pd.set_option("display.precision", 4)
# pd.set_option('precision', 10)
pd.set_option('display.float_format', lambda x: '%.3f' % x)

In [11]:
movies = pd.read_csv("data/movie.csv")
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [12]:
ratings = pd.read_csv("data/rating.csv")
ratings.head()

   userId  movieId  rating            timestamp
0       1        2     3.5  2005-04-02 23:53:47
1       1       29     3.5  2005-04-02 23:31:16
2       1       32     3.5  2005-04-02 23:33:39
3       1       47     3.5  2005-04-02 23:32:07
4       1       50     3.5  2005-04-02 23:29:40

In [13]:
tags = pd.read_csv("data/tag.csv")
tags.head()

   userId  movieId            tag            timestamp
0      18     4141    Mark Waters  2009-04-24 18:19:40
1      65      208      dark hero  2013-05-10 01:41:18
2      65      353      dark hero  2013-05-10 01:41:19
3      65      521  noir thriller  2013-05-10 01:39:43
4      65      592      dark hero  2013-05-10 01:41:18

In [20]:
ratings.describe()

            userId      movieId       rating
count 20000263.000 20000263.000 20000263.000
mean     69045.873     9041.567        3.526
std      40038.627    19789.477        1.052
min          1.000        1.000        0.500
25%      34395.000      902.000        3.000
50%      69141.000     2167.000        3.500
75%     103637.000     4770.000        4.000
max     138493.000   131262.000        5.000